/*
 * Copyright 2000-2015 Rochus Keller <mailto:rkeller@nmr.ch>
 *
 * This file is part of CARA (Computer Aided Resonance Assignment,
 * see <http://cara.nmr.ch/>).
 *
 * CARA is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License (GPL) as
 * published by the Free Software Foundation, either version 2 of
 * the License, or (at your option) any later version.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */

#include "ReportViewer.h"
using namespace Spec;

// Qt
#include <qtextstream.h> 
#include <qinputdialog.h> 
#include <qmessagebox.h>
#include <QFileDialog>
#include <qdir.h> 
#include <qmenubar.h>
#include <qsplitter.h> 
#include <q3vbox.h>
#include <qcombobox.h> 
#include <Gui/ListView.h> 
#include <q3scrollview.h> 
#include <qcolordialog.h>
#include <qfontdialog.h>
#include <qdatastream.h>
#include <qfile.h>
#include <QFileDialog>
#include <QHideEvent>
#include <QPrintDialog>
#include <QSettings>

#include <Root/ActionHandler.h>
#include <Root/Command.h>
#include <Root/Application.h>
#include <Root/UpstreamFilter.h>
using namespace Root;

#include <Lexi/LayoutKit.h>
#include <QColor>
#include <Lexi/CommandLine.h>
#include <Lexi/Splitter.h>
#include <Lexi/Redirector.h>
#include <Lexi/Background.h>
#include <Lexi/Bevel.h>
#include <Lexi/Interactor.h>

    { ReportViewer::RulerColor, &ReportViewer::handleRulerColor },
    { ReportViewer::RulerMajor, &ReportViewer::handleRulerMajor },
    { ReportViewer::SetWidth, &ReportViewer::handleSetWidth },
    { ReportViewer::PpmRange, &ReportViewer::handlePpmRange },
    { ReportViewer::FrameSize, &ReportViewer::handleFrameSize },
    { ReportViewer::PosColor, &ReportViewer::handlePosColor },
    { ReportViewer::NegColor, &ReportViewer::handleNegColor },
    { ReportViewer::FrameColor, &ReportViewer::handleFrameColor },
    { ReportViewer::FrameWidth, &ReportViewer::handleFrameWidth },
    { ReportViewer::SetLandscape, &ReportViewer::handleSetLandscape },
    { ReportViewer::PageSize, &ReportViewer::handlePageSize },
    { Root::Action::EditCopy, &ReportViewer::handleEditCopy },
    { Root::Action::FilePrint, &ReportViewer::handleFilePrint },
    { ReportViewer::ContourParams, &ReportViewer::handleContourParams },
ACTION_SLOTS_END( ReportViewer )

//////////////////////////////////////////////////////////////////////



ReportViewer::Setup::Setup()
{
	d_pageSize = 0;
	d_landscape = false;
	d_frameW = 0;
	d_frameH = 0;
	d_frameLw = 20;
	d_frameClr = ( Qt::black );

	QColor black = ( Qt::black );
	QColor gray = ( Qt::gray );
	d_posClr.assign( ClrTableSize, Qt::black );
	d_negClr.assign( ClrTableSize, Qt::black );
	for( int i = 0; i < ClrTableSize; i++ )
	{
		d_posClr[ i ] = black;
		d_negClr[ i ] = gray;
	}
	d_contLw = 20;

	d_rulFont.setPointSize( 200 / TwipsPerPoint );
	d_rulClr = ( Qt::black );
	d_space[ DimY ] = 1000;
	d_space[ DimX ] = 1300;
	d_count[ DimY ] = d_count[ DimX ] = 5;
	d_rulLw = 20;
	d_showH = true;
	d_showV = true;
	d_anchLabel = false;

	d_peakFont.setPointSize( 160 / TwipsPerPoint );
	d_peakClr = ( Qt::red );
	d_peakLw = 20;
	d_peakOff = 0;
	d_peakAng = 45;
	d_showPeak = true;

	d_spinFont.setPointSize( 160 / TwipsPerPoint );
	d_spinClr = ( Qt::red );
	d_spinLw = 20;
	d_spinOff = 0;
	d_spinAng = 45;
	d_showSpin = true;
	d_spinLbl = SpinPointView::PairIdLabelSysOrResi;
	d_showCross = true;

	d_linkClr = ( Qt::darkRed );
	d_linkLw = 20;
	d_showVerti = true;
	d_showCenter = true;

	d_centClr = ( Qt::gray );

	d_titleClr = ( Qt::black );
	d_titleFont.setPointSize( 320 / TwipsPerPoint );
	d_showTitle = true;

	d_showFolded = false;
}

static const qint32 s_magic = 302166938;
static const qint32 s_version = 6;

void ReportViewer::Setup::save(const char * path)
{
	QFile f( path );
	if( !f.open( QIODevice::WriteOnly ) )
		throw Root::Exception( "Could not open/write file ", path );
	QDataStream os( &f );                        
	os << s_magic; // 1
	os << s_version; // 2

	os << qint32( d_pageSize ); // 3
	os << qint32( d_landscape ); // 4
	os << d_frameW; // 5
	os << d_frameH; // 6
	os << d_frameLw; // 7
	os << d_frameClr; // 8
	os << qint32( d_posClr.size() ); // 9
	for( long j = 0; j < d_posClr.size(); j++ )
	{
		os << QColor( d_posClr[j] ); // 10
		os << QColor( d_negClr[j] ); // 11
	}
	os << d_contLw; // 12
	os << d_rulFont; // 13
	os << ( d_rulClr ); // 14
	os << d_space[ DimX ]; // 15
	os << d_space[ DimY ]; // 16
	os << d_count[ DimX ]; // 17
	os << d_count[ DimY ]; // 18
	os << d_rulLw; // 19
	os << qint32( d_showH ); // 20
	os << qint32( d_showV ); // 21
	os << qint32( d_anchLabel ); // 22
	os << d_peakFont; // 23
	os << ( d_peakClr ); // 24
	os << d_peakLw; // 25
	os << d_peakOff; // 26
	os << d_peakAng; // 27
	os << qint32( d_showPeak ); // 28
	os << d_spinFont; // 29
	os << ( d_spinClr ); // 30
	os << d_spinLw; // 31
	os << d_spinOff; // 32
	os << d_spinAng; // 33
	os << qint32( d_showSpin ); // 34
	os << qint32( d_spinLbl ); // 35
	os << qint32( d_links.size() ); // 36
	Root::SymbolSet::const_iterator i;
	for( i = d_links.begin(); i != d_links.end(); ++i )
		os << (*i).data(); // 37
	os << ( d_linkClr ); // 38
	os << d_linkLw; // 39
	os << qint32( d_showVerti ); // 40
	os << qint32( d_showCenter ); // 41
	os << ( d_centClr ); // 42
	os << d_range[ DimX ].first; // 43
	os << d_range[ DimX ].second; // 44
	os << d_range[ DimY ].first; // 45
	os << d_range[ DimY ].second; // 46
	os << d_titleFont; // 47
	os << ( d_titleClr ); // 48
	os << qint32( d_showTitle ); // 49
	os << qint32( d_showCross ); // 50
	os << qint32( d_showFolded ); // 51
}

void ReportViewer::Setup::save2(const char * path)
{
    QSettings out( path, QSettings::IniFormat );

    if( !out.isWritable() )
        throw Root::Exception( "Could not open/write file ", path );

    out.setValue( "magic", s_magic );
    out.setValue( "version", s_version );
    out.setValue( "pageSize", d_pageSize );
    out.setValue( "landscape", d_landscape );
    out.setValue( "frameW", d_frameW );
    out.setValue( "frameH", d_frameH );
    out.setValue( "frameLw", d_frameLw );
    out.setValue( "frameClr", d_frameClr );

    out.beginWriteArray( "posNegClr" );
    int n;
	for( n = 0; n < d_posClr.size(); n++ )
	{
        out.setArrayIndex( n );
        out.setValue( "posClr", d_posClr[n] );
        out.setValue( "negClr", d_negClr[n] );
	}
    out.endArray();

    out.setValue( "contLw", d_contLw );
    out.setValue( "rulFont", d_rulFont );
    out.setValue( "rulClr", d_rulClr );
    out.setValue( "spaceH", d_space[ DimX ] );
    out.setValue( "spaceV", d_space[ DimY ] );
    out.setValue( "countH", d_count[ DimX ] );
    out.setValue( "countV", d_count[ DimY ] );
    out.setValue( "rulLw", d_rulLw );
    out.setValue( "showH", d_showH );
    out.setValue( "showV", d_showV );
    out.setValue( "anchLabel", d_anchLabel );
    out.setValue( "peakFont", d_peakFont );
    out.setValue( "peakClr", d_peakClr );
    out.setValue( "peakLw", d_peakLw );
    out.setValue( "peakOff", d_peakOff );
    out.setValue( "peakAng", d_peakAng );
    out.setValue( "showPeak", d_showPeak );
    out.setValue( "spinFont", d_spinFont );
    out.setValue( "spinClr", d_spinClr );
    out.setValue( "spinLw", d_spinLw );
    out.setValue( "spinOff", d_spinOff );
    out.setValue( "spinAng", d_spinAng );
    out.setValue( "showSpin", d_showSpin );
    out.setValue( "spinLbl", d_spinLbl );


    out.beginWriteArray( "links" );
	Root::SymbolSet::const_iterator i;
    n = 0;
	for( i = d_links.begin(); i != d_links.end(); ++i, n++ )
    {
        out.setArrayIndex( n );
        out.setValue( "link", (*i).data() );
    }
    out.endArray();
    out.setValue( "linkClr", d_linkClr );
    out.setValue( "linkLw", d_linkLw );
    out.setValue( "showVerti", d_showVerti );
    out.setValue( "showCenter", d_showCenter );
    out.setValue( "centClr", d_centClr );
    out.setValue( "rangeHfrom", d_range[ DimX ].first );
    out.setValue( "rangeHto", d_range[ DimX ].second );
    out.setValue( "rangeVfrom", d_range[ DimY ].first );
    out.setValue( "rangeVto", d_range[ DimY ].second );
    out.setValue( "titleFont", d_titleFont );
    out.setValue( "titleClr", d_titleClr );
    out.setValue( "showTitle", d_showTitle );
    out.setValue( "showCross", d_showCross );
    out.setValue( "showFolded", d_showFolded );
}

void ReportViewer::Setup::load(const char * path)
{
	QFile f( path );
	if( !f.open( QIODevice::ReadOnly ) ) 
		throw Root::Exception( "Could not open/read file ", path );
	QDataStream is( &f );                        // serialize using f
    is.setVersion( QDataStream::Qt_4_2 );

	qint32 magic;
	qint32 version;
	is >> magic; // 1
	if( magic != s_magic )
		throw Root::Exception( "Invalid print preview setup file format" );
	is >> version; // 2
	if( version < 6 || version > s_version )
		throw Root::Exception( "Invalid print preview setup file version" );

	QColor clr;
	QFont ft;
	qint32 tmp;
	is >> tmp; // 3
	d_pageSize = tmp;
	is >> tmp; // 4
	d_landscape = tmp != 0; 
	is >> d_frameW; // 5
	is >> d_frameH; // 6
	is >> d_frameLw; // 7
	is >> d_frameClr; // 8
	if( version < 4 )
	{
		is >> d_posClr[0];
		is >> d_negClr[0];
	}else
	{
		qint32 count;
		is >> count; // 9
		for( long j = 0; j < count; j++ )
		{
			is >> clr; // 10
			if( j < ClrTableSize )
				d_posClr[j] = clr;
			is >> clr; // 11
			if( j < ClrTableSize )
				d_negClr[j] = clr;
		}
	}
	is >> d_contLw; // 12
	is >> d_rulFont; // 13
	is >> d_rulClr; // 14
	is >> d_space[ DimX ]; // 15
	is >> d_space[ DimY ]; // 16
	is >> d_count[ DimX ]; // 17
	is >> d_count[ DimY ]; // 18
	is >> d_rulLw; // 19
	is >> tmp; // 20
	d_showH = tmp != 0;
	is >> tmp; // 21
	d_showV = tmp != 0;
	if( version >= 3 )
	{
		is >> tmp; // 22
		d_anchLabel = tmp != 0;
	}
	is >> d_peakFont; // 23
	is >> d_peakClr; // 24
	is >> d_peakLw; // 25
	is >> d_peakOff; // 26
	is >> d_peakAng; // 27
	is >> tmp; // 28
	d_showPeak = tmp != 0;
	is >> d_spinFont; // 29
	is >> d_spinClr; // 30
	is >> d_spinLw; // 31
	is >> d_spinOff; // 32
	is >> d_spinAng; // 33
	is >> tmp; // 34
	d_showSpin = tmp != 0;
	is >> tmp; // 35
	d_spinLbl = (SpinPointView::Label) tmp;
	qint32 count;
	is >> count; // 36
	d_links.clear();
	char* str;
	for( long i = 0; i < count; ++i )
	{
		is >> str; // 37
		d_links.insert( str );
		delete[] str;
	}
	is >> d_linkClr; // 38
	is >> d_linkLw; // 39
	is >> tmp; // 40
	d_showVerti = tmp != 0;
	is >> tmp; // 41
	d_showCenter = tmp != 0;
	is >> d_centClr; // 42
	is >> d_range[ DimX ].first; // 43
	is >> d_range[ DimX ].second; // 44
	is >> d_range[ DimY ].first; // 45
	is >> d_range[ DimY ].second; // 46

	if( version >= 2 )
	{
		is >> d_titleFont; // 47
		is >> d_titleClr; // 48
		is >> tmp; // 49
		d_showTitle = tmp != 0;
	}
	if( version >= 5 )
	{
		is >> tmp; // 50
		d_showCross = tmp != 0;
		is >> tmp; // 51
		d_showFolded = tmp != 0;
	}
}

void ReportViewer::Setup::load2( const char* path )
{
    QSettings in( path, QSettings::IniFormat );

    if( in.status() != QSettings::NoError )
		throw Root::Exception( "Could not open/read file ", path );

    if( in.value( "magic" ).toUInt() != s_magic )
		throw Root::Exception( "Invalid print preview setup file format" );
    if( in.value( "version" ).toUInt() != s_version )
		throw Root::Exception( "Invalid print preview setup file version" );

#define _READ( name, to, type ) if( in.contains( name ) ) to = in.value( name ).value<type>();

    _READ( "pageSize", d_pageSize, int );
    _READ( "landscape", d_landscape, bool );
    _READ( "frameW", d_frameW, qint32 );
    _READ( "frameH", d_frameH, qint32 );
    _READ( "frameLw", d_frameLw, qint32 );
    _READ( "frameClr", d_frameClr, QColor );

    quint32 count = in.beginReadArray( "posNegClr" );
    quint32 n;
